lvx/extension/Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>бит_СерииСгенерированы</Name>
					<Comment>ЛТ 6.7</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>бит_ГруппировкиПечатиБегунков</Name>
					<Comment>ЛТ6.9 [Микляев К.А.]</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АгрегированнаяНоменклатура</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СигнатураСостава</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распечатано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>бит_СоставГруппировокПечатиБегунков</Name>
					<Comment>ЛТ6.9 [Микляев К.А.]</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиПродукции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/extension/Documents/ЗаказНаПроизводство2_2/Ext/ObjectModule.bsl
&Перед("ПередЗаписью")
Процедура бит_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат;
	КонецЕсли;
	
	Если НужноСброситьПризнакГенерацииСерий() Тогда
		бит_СерииСгенерированы = Ложь;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Не бит_СерииСгенерированы Тогда
		бит_СерииСгенерированы = Истина;
		ДополнительныеСвойства.Вставить("бит_НужноСинхронизироватьСерииНоменклатуры", Истина);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.9] [Микляев К.А.] [03.06.2026] +
	бит_ПечатьПроизводственныхЗаданийСервер.АктуализироватьГруппировкиЗаказа(ЭтотОбъект);
	// }}ПервыйБИТ ЛистТребований [ЛТ6.9] [Микляев К.А.] [03.06.2026] -
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура бит_ОбработкаПроведения(Отказ, РежимПроведения)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеСвойстваСинхронизации = Неопределено;
	Если ДополнительныеСвойства.Свойство("бит_НужноСинхронизироватьСерииНоменклатуры", ЗначениеСвойстваСинхронизации) Тогда
		НужноСинхронизироватьСерии = (ЗначениеСвойстваСинхронизации = Истина);
	Иначе
		НужноСинхронизироватьСерии = Не бит_СерииСгенерированы;
	КонецЕсли;	
	Если Не НужноСинхронизироватьСерии Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		СинхронизироватьСерииНоменклатуры();
		бит_СерииСгенерированы = Истина;
	Исключение
		Отказ = Истина;
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецПроцедуры

Функция НужноСброситьПризнакГенерацииСерий()
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	Если Не бит_СерииСгенерированы Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказНаПроизводство2_2.Номер КАК Номер,
	|	ЗаказНаПроизводство2_2.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство2_2
	|ГДЕ
	|	ЗаказНаПроизводство2_2.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Выборка.Номер <> Номер Или Выборка.Дата <> Дата Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат ПодписьПродукцииОбъекта() <> ПодписьПродукцииИзБазы();
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецФункции

Функция ПодписьПродукцииОбъекта()
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	ТаблицаПродукции = Новый ТаблицаЗначений;
	ДобавитьКолонкиПодписиПродукции(ТаблицаПродукции);
	
	Для Каждого СтрокаПродукции Из ЭтотОбъект.Продукция Цикл
		НоваяСтрока = ТаблицаПродукции.Добавить();
		ЗаполнитьСтрокуПодписиПродукции(НоваяСтрока, СтрокаПродукции);
	КонецЦикла;
	
	Возврат ПодписьТаблицыПродукции(ТаблицаПродукции);
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецФункции

Функция ПодписьПродукцииИзБазы()
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Продукция.НомерСтроки КАК НомерСтроки,
	|	Продукция.Номенклатура КАК Номенклатура,
	|	Продукция.Характеристика КАК Характеристика,
	|	Продукция.Упаковка КАК Упаковка,
	|	Продукция.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Продукция.Количество КАК Количество,
	|	Продукция.Склад КАК Склад,
	|	Продукция.Отменено КАК Отменено
	|ИЗ
	|	Документ.ЗаказНаПроизводство2_2.Продукция КАК Продукция
	|ГДЕ
	|	Продукция.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат ПодписьТаблицыПродукции(Запрос.Выполнить().Выгрузить());
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецФункции

Процедура ДобавитьКолонкиПодписиПродукции(ТаблицаПродукции)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	ТаблицаПродукции.Колонки.Добавить("НомерСтроки");
	ТаблицаПродукции.Колонки.Добавить("Номенклатура");
	ТаблицаПродукции.Колонки.Добавить("Характеристика");
	ТаблицаПродукции.Колонки.Добавить("Упаковка");
	ТаблицаПродукции.Колонки.Добавить("КоличествоУпаковок");
	ТаблицаПродукции.Колонки.Добавить("Количество");
	ТаблицаПродукции.Колонки.Добавить("Склад");
	ТаблицаПродукции.Колонки.Добавить("Отменено");
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецПроцедуры

Процедура ЗаполнитьСтрокуПодписиПродукции(СтрокаПодписи, СтрокаПродукции)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	СтрокаПодписи.НомерСтроки = СтрокаПродукции.НомерСтроки;
	СтрокаПодписи.Номенклатура = СтрокаПродукции.Номенклатура;
	СтрокаПодписи.Характеристика = СтрокаПродукции.Характеристика;
	СтрокаПодписи.Упаковка = СтрокаПродукции.Упаковка;
	СтрокаПодписи.КоличествоУпаковок = СтрокаПродукции.КоличествоУпаковок;
	СтрокаПодписи.Количество = СтрокаПродукции.Количество;
	СтрокаПодписи.Склад = СтрокаПродукции.Склад;
	СтрокаПодписи.Отменено = СтрокаПродукции.Отменено;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецПроцедуры

Функция ПодписьТаблицыПродукции(ТаблицаПродукции)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	ТаблицаПродукции.Сортировать("НомерСтроки, Номенклатура, Характеристика, Упаковка, Склад");
	
	Подпись = "";
	Для Каждого СтрокаПродукции Из ТаблицаПродукции Цикл
		Подпись = Подпись
			+ Формат(СтрокаПродукции.НомерСтроки, "ЧГ=0") + "|"
			+ ЗначениеВСтрокуВнутр(СтрокаПродукции.Номенклатура) + "|"
			+ ЗначениеВСтрокуВнутр(СтрокаПродукции.Характеристика) + "|"
			+ ЗначениеВСтрокуВнутр(СтрокаПродукции.Упаковка) + "|"
			+ Формат(СтрокаПродукции.КоличествоУпаковок, "ЧГ=0") + "|"
			+ Формат(СтрокаПродукции.Количество, "ЧГ=0") + "|"
			+ ЗначениеВСтрокуВнутр(СтрокаПродукции.Склад) + "|"
			+ ?(СтрокаПродукции.Отменено, "1", "0") + Символы.ПС;
	КонецЦикла;
	
	Возврат Подпись;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецФункции

Процедура СинхронизироватьСерииНоменклатуры()
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	ВидыНоменклатурыКГенерации = ВидыНоменклатурыПродукцииССерийнымУчетом();
	СуществующиеСерии = СуществующиеСерииПоЗаказу();
	
	Для Каждого ОписаниеСерии Из СуществующиеСерии Цикл
		Если ВидыНоменклатурыКГенерации.Получить(ОписаниеСерии.ВидНоменклатуры) = Неопределено Тогда
			УдалитьСериюНоменклатуры(ОписаниеСерии.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОписаниеВида Из ВидыНоменклатурыКГенерации Цикл
		СерияНоменклатуры = НайтиСериюПоВиду(СуществующиеСерии, ОписаниеВида.Ключ);
		Если СерияНоменклатуры = Неопределено Тогда
			СерияНоменклатуры = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Иначе
			СерияНоменклатуры = СерияНоменклатуры.ПолучитьОбъект();
		КонецЕсли;
		
		ЗаполнитьСериюНоменклатуры(СерияНоменклатуры, ОписаниеВида.Ключ);
		СерияНоменклатуры.Записать();
	КонецЦикла;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецПроцедуры

Функция ВидыНоменклатурыПродукцииССерийнымУчетом()
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	Результат = Новый Соответствие;
	
	Для Каждого СтрокаПродукции Из ЭтотОбъект.Продукция Цикл
		Если СтрокаПродукции.Отменено
			Или Не ЗначениеЗаполнено(СтрокаПродукции.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		ВидНоменклатуры = СтрокаПродукции.Номенклатура.ВидНоменклатуры;
		Если ЗначениеЗаполнено(ВидНоменклатуры)
			И ВидНоменклатуры.ИспользоватьСерии Тогда
			Результат.Вставить(ВидНоменклатуры, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецФункции

Функция СуществующиеСерииПоЗаказу()
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка КАК Ссылка,
	|	СерииНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.бит_ЗаказНаПроизводство = &ЗаказНаПроизводство
	|	И НЕ СерииНоменклатуры.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СерииНоменклатуры.Ссылка");
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецФункции

Функция НайтиСериюПоВиду(СуществующиеСерии, ВидНоменклатуры)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	СтруктураОтбора = Новый Структура("ВидНоменклатуры", ВидНоменклатуры);
	СтрокиСерий = СуществующиеСерии.НайтиСтроки(СтруктураОтбора);
	
	Если СтрокиСерий.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Индекс = 1 По СтрокиСерий.Количество() - 1 Цикл
		УдалитьСериюНоменклатуры(СтрокиСерий[Индекс].Ссылка);
	КонецЦикла;
	
	Возврат СтрокиСерий[0].Ссылка;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецФункции

Процедура ЗаполнитьСериюНоменклатуры(СерияНоменклатуры, ВидНоменклатуры)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	СерияНоменклатуры.Наименование = Номер;
	СерияНоменклатуры.Номер = Номер;
	СерияНоменклатуры.ДатаПроизводства = НачалоДня(Дата);
	СерияНоменклатуры.ВидНоменклатуры = ВидНоменклатуры;
	СерияНоменклатуры.бит_ЗаказНаПроизводство = Ссылка;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецПроцедуры

Процедура УдалитьСериюНоменклатуры(СерияНоменклатуры)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] +
	Если Не ЗначениеЗаполнено(СерияНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		СерияНоменклатуры.ПолучитьОбъект().Удалить();
	Исключение
		ВызватьИсключение "Не удалось удалить серию номенклатуры, которая больше не относится к заказу на производство: "
			+ Строка(СерияНоменклатуры) + ". " + ОписаниеОшибки() + " (Лист требований 6.7)";
	КонецПопытки;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.7] [Микляев К.А.] [03.06.2026] -
КонецПроцедуры
